michael-ring/espsdk4fpc/sdkconfig.defaults.esp32s2.release
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s2"
#CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
CONFIG_BT_ENABLED=y
CONFIG_BLE_MESH=y
#CONFIG_TEMP_SENSOR_ENABLE_DEBUG_LOG=y
#CONFIG_SDM_ENABLE_DEBUG_LOG=y
#CONFIG_GPTIMER_ENABLE_DEBUG_LOG=y
#CONFIG_PCNT_ENABLE_DEBUG_LOG=y
#CONFIG_RMT_ENABLE_DEBUG_LOG=y
#CONFIG_MCPWM_ENABLE_DEBUG_LOG=y
#CONFIG_I2S_ENABLE_DEBUG_LOG=y
#CONFIG_PARLIO_ENABLE_DEBUG_LOG=y
#CONFIG_I2C_ENABLE_DEBUG_LOG=y
CONFIG_ESP_TLS_PSK_VERIFICATION=y
CONFIG_ESP_GDBSTUB_SUPPORT_TASKS=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH=y
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
#CONFIG_LCD_ENABLE_DEBUG_LOG=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=1
#CONFIG_ESP_PHY_PLL_TRACK_DEBUG=y
#CONFIG_ESP_DEBUG_STUBS_ENABLE=y
#CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_APPLICATION_TASK_TAG=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
#CONFIG_HEAP_POISONING_COMPREHENSIVE=y
#CONFIG_IEEE802154_DEBUG=y
CONFIG_LOG_MASTER_LEVEL=y
CONFIG_LOG_COLORS=n
CONFIG_MQTT_PROTOCOL_5=y

